# KilonewtonsPerSquareMeter Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
UnitTypeId..::..KilonewtonsPerSquareMeter Property
UnitTypeId Class See Also
---
Kilonewtons per square meter.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId KilonewtonsPerSquareMeter { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property KilonewtonsPerSquareMeter As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ KilonewtonsPerSquareMeter {
	ForgeTypeId^ get ();
}
```

# See Also
UnitTypeId Class
Autodesk.Revit.DB Namespace